**** code in process

#+BEGIN_SRC clojure :results silent
(definst someother-fnoise [vol 0.1 ffreq 1000]
  (lpf (* (pink-noise)
          vol)
       ffreq))

(someother-fnoise 0.7)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(someother-fnoise :vol 0.6)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl someother-fnoise :ffreq 500)
#+END_SRC

Use atoms for "hot-swapping" values??!!

#+BEGIN_SRC clojure :results silent
  (def ffl (atom 200))
  (def ffh (atom 8000))

#+END_SRC

#+BEGIN_SRC clojure :results silent

  (on-event [:midi :control-change]
            (fn [{cc-channel :note vel :velocity}]
              (cond (= cc-channel 1) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                    (= cc-channel 2) (ctl someother-fnoise :ffreq (scale-range vel 1 127 @ffl @ffh))
                    (= cc-channel 3) (reset! ffl (* vel 100))
                    (= cc-channel 4) (reset! ffh (* vel 100))
                    ))
            ::someother-pooper)

#+END_SRC

#+BEGIN_SRC clojure :results silent

    (on-event [:midi :control-change]
              (fn [{cc-channel :note vel :velocity}]
                (cond (= cc-channel 1) (do (reset! ffl (/ vel 127 )) 
                                           (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1)))
                      (= cc-channel 2) (do (reset! ffh (* vel 10))
                                           (ctl someother-fnoise :ffreq (scale-range vel 1 127 @ffl @ffh)))
                      ))
              ::someother-pooper-do)

#+END_SRC


#+BEGIN_SRC clojure
(list @ffl @ffh)
#+END_SRC

#+RESULTS:
| 113/127 | 1500 |

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::someother-pooper)
#+END_SRC

#+BEGIN_SRC clojure :results silent
;;; Note this presents problems; why?
(on-event [:midi :control-change]
          (fn [{cc-channel :note vel :velocity}]
            (cond (= cc-channel 1) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 2) (ctl someother-fnoise :ffreq (scale-range vel 1 127 200 8000))
                  (= cc-channel 3) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 4) (ctl someother-fnoise :ffreq (scale-range vel 1 127 (* 200))
                  (= cc-channel 5) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 6) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 7) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 8) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 40) (ctl someother-fnoise :vol   (scale-range vel 1 127 0 1))
                  (= cc-channel 41) (ctl someother-fnoise :ffreq   (scale-range vel 1 127 100 1000))
                  ))
          ::someother-pooper)

#+END_SRC
** Polling and running 
#+BEGIN_SRC clojure 
(run (poll:kr (impulse:kr 10) (abs  (* 1000 (pink-noise:kr))) "polled-val:"))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 112>

#+BEGIN_SRC clojure :results silent
(run (poll:kr (impulse:kr 10) (* 1000 (sin-osc:kr)) "polled-val:"))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(run 20 (poll:kr (impulse:kr 5) (line:kr 0.0 10.0 20)) "polled-val:"))
#+END_SRC
** [#A] make a polling and running macro to read ugen values
:PROPERTIES:
:ID:       FAE2CB90-90F5-4D5E-897F-22419F70FCF0
:END:
#+BEGIN_SRC clojure
(defmacro read-ugen [dur ugen]
`(run ~dur (poll:kr (impulse:kr 2) ~ugen)))
#+END_SRC

#+RESULTS:
: #'user/read-ugen

#+BEGIN_SRC clojure :results output

#+END_SRC

#+RESULTS:

** mono defsynth out
#+BEGIN_SRC clojure 
  (defsynth test [freq 440 amp 0.1]
    (out 0 (* amp (sin-osc freq))))

  (test)
#+END_SRC

#+RESULTS:
: #<synth: test>#<synth-node[loading]: user/test 89>

#+BEGIN_SRC clojure
  (defsynth test-pan [freq 440 amp 0.1]
    (out 0 (pan2 (* amp (sin-osc freq)))))

  (test-pan)
#+END_SRC

#+RESULTS:
: #<synth: test-pan>#<synth-node[loading]: user/test-pan 90>


#+BEGIN_SRC clojure
  (defsynth test-pan2 [freq1 440 freq1-pan -0.5 freq2 443 freq2-pan 0.5 amp 0.1]
    (out 0 (pan2 (* amp (sin-osc freq1)) freq1-pan 0.5))
    (out 1 (pan2 (* amp (saw freq2)) freq2-pan 0.5))
    )

  (test-pan2)
#+END_SRC

#+RESULTS:
: #<synth: test-pan2>#<synth-node[loading]: user/test-pan2 94>

*** function
#+BEGIN_SRC clojure :results output
(examples)
#+END_SRC

#+RESULTS:
#+begin_example
svf
  :state-filter    (:ar) - Create a state variable 
                           filter 

sound-in
  :mono-patch      (:ar) - World's most expensive 
                           patchcord 
  :stereo-patch    (:ar) - World's most expensive 
                           stereo patchcord 

impulse
  :poll            (:kr) - Poll an impulse to view 
                           its output 

send-reply
  :count           (:kr) - Send back an OSC 
                           message containing a 
                           rolling count 

amplitude
  :saw-vol         (:ar) - Use input amplitude to 
                           control saw amplitude 
  :sin-freq        (:ar) - Use input amplitude to 
                           control saw frequency 

dibrown
  :rand-walk       (:ar) - Random whole number 
                           walk through freqs with 
                           rate determined by 
                           mouse-x 

membrane-hexagon
  :mouse           (:kr) - Use mouse button, X and 
                           Y locations to play a 
                           drum. 

vosim
  :mouse1          (:ar) - Use mouse X location to 
                           control the frequency 
                           of the vosim. 
  :mouse2          (:ar) - Use the mouse X & Y 
                           location to modify some 
                           random vosim noises. 

membrane-circle
  :mouse           (:kr) - Use mouse button, X and 
                           Y locations to play a 
                           drum. 

dbrown
  :rand-walk       (:ar) - Random floating point 
                           number walk through 
                           freqs with rate 
                           determined by mouse-x 

dyn-klang
  :sin-osc         (:ar) - Use a sin-osc to change 
                           3 running sine 
                           oscillators 

dwhite
  :rand-seq        (:ar) - Play a random sequence 
                           of floats mapped to 
                           freqs with rate 
                           determined by mouse-x 

dyn-klank
  :mouse           (:ar) - Use mouse to change 3 
                           running frequency 
                           resonators 

compander
  :noise-gate      (:ar) - Use compander to create 
                           a noise gate 
  :data            (:ar) - View data coming out of 
                           a compander 

diwhite
  :rand-seq        (:ar) - Play a random sequence 
                           of integers mapped to 
                           freqs with rate 
                           determined by mouse-x 

b-moog
  :compare-filters (:ar) - Compare low, high, and 
                           bandpass 

iir-filter
  :low-pass        (:ar) - Create a low pass 
                           filter 

#+end_example
** simple example over =demo=
Note that this works, but if we try to pass a "duration" argument to
=demo=...
#+BEGIN_SRC clojure
(defn test
  [freq]
  (demo (sin-osc freq)))
#+END_SRC

#+RESULTS:
: #'overtone.examples.buses.getonthebus/test

...Clojure complains:

#+BEGIN_SRC clojure
(defn test1
  [dur]
  (demo dur (sin-osc)))
#+END_SRC

#+RESULTS:

However, using a macro...

#+BEGIN_SRC clojure
(defmacro my-demo
  [dur]
  `(demo ~dur (sin-osc)))
#+END_SRC

#+RESULTS:
: #'overtone.examples.buses.getonthebus/my-demo

#+BEGIN_SRC clojure
(my-demo 0.1)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: overtone.exam736/audition-synth 212>
** pass in ugens to demo
:PROPERTIES:
:ID:       EB78186B-636E-40F4-A2B3-E38FC312DD3F
:END:

#+BEGIN_SRC clojure
(defmacro my-ugen-demo
  [dur ugen]
  `(demo ~dur (~ugen)))
#+END_SRC

#+RESULTS:
: #'user/my-ugen-demo

See examples of usage below

** the four waveforms (a la Nonesuch Guide to Electronic Music)
Uses my-ugen-demo as defined above:
[[id:EB78186B-636E-40F4-A2B3-E38FC312DD3F][pass in ugens to demo]]

#+BEGIN_SRC clojure :results silent
(my-ugen-demo 5 sin-osc)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(my-ugen-demo 5 saw)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(my-ugen-demo 5 lf-tri)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(my-ugen-demo 5 pulse)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (pulse 440 0.1))
#+END_SRC

#+BEGIN_SRC clojure
(demo 4 (pulse 440 0.9))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 277>

#+BEGIN_SRC clojure :results silent
(demo 4 (pulse 440 0.5))

;; square being a special case of pulse/rectangular
(my-ugen-demo 5 square)
#+END_SRC





#+BEGIN_SRC clojure :results silent
(my-ugen-demo 0.1 blip)
#+END_SRC
*** use randomness
#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ (weighted-choose [10 400] [0.1 0.9])  (* (weighted-choose [10 400] [0.1 0.9]) (pink-noise)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
  (let [hz  (choose (take 5 (reverse (map #(* % 100) (range 10)))))]
    (demo 2 (sin-osc (+ hz (* 400 (pink-noise))))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (brown-noise)))))
#+END_SRC


#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-noise0 10)))))
#+END_SRC


#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-noise1 10)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-noise2 10)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-brown-noise0 10)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 4 (sin-osc (+ 800 (* 100 (lf-clip-noise 10)))))
#+END_SRC

#+BEGIN_SRC clojure
(demo 4 (sin-osc (+ 350 (* (* 100 (lf-brown-noise0:kr 5)) (lf-clip-noise 4)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 10 (sin-osc (* 0.5 (+ (* 900 (lf-brown-noise0:kr 20)) (* (* 100 (lf-brown-noise0:kr 1)) (lf-clip-noise 2))))))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 338>


#+RESULTS:
: #<synth-node[loading]: user/audition-synth 338>

** use 'repeatedly' to approximate sclang expansions
#+BEGIN_SRC clojure :results silent
(demo (mix (repeatedly 10 #(sin-osc (+ 200 (rand-int 999))))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo (mix [(sin-osc 220) (sin-osc 420)]))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(dotimes [n 2] (demo (sin-osc (+ 200 (rand-int 999)))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(dotimes [n 2] (demo (sin-osc (+ 200 (rand-int 999)))))
#+END_SRC

#+BEGIN_SRC clojure
  (definst clang [note 60 amp 0.3]
    (let [freq (midicps note)]
      (* amp
         (mix (repeatedly 5 #(sin-osc (+ 200 (rand-int 999)))))
         (env-gen (lin 0.01 1 1 1) 1 1 0 1 FREE))))
#+END_SRC

#+RESULTS:
: nil#<instrument: clang>

#+BEGIN_SRC clojure :results silent
(clang)
#+END_SRC


#+BEGIN_SRC clojure
  (defsynth clang1 []
      (out 0 (mix (repeatedly 10 #(sin-osc (+ 200 (rand-int 999)))))))
#+END_SRC

#+RESULTS:
: nil#<synth: clang1>

#+BEGIN_SRC clojure :results silent
(clang1)
#+END_SRC

** develop macro and event handler to for random synth player
#+BEGIN_SRC clojure
(defmacro play-rand []
`(demo 0.4 (mix (repeatedly 10 #(sin-osc (+ 200 (rand-int 999)))))))
#+END_SRC

#+RESULTS:
: #'user/play-rand

#+BEGIN_SRC clojure :results silent
(play-rand)
#+END_SRC

#+BEGIN_SRC clojure
(defmacro play-rand2 [amp]
`(demo 0.4       (* ~amp
         (mix (repeatedly 5 #(sin-osc (+ 200 (rand-int 999)))))
         (env-gen (lin 0.01 1 1 1) 1 1 0 1 FREE))))
#+END_SRC

#+RESULTS:
: #'user/play-rand2

#+BEGIN_SRC clojure
(play-rand2 0.1)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC clojure :results silent
(demo 10 (* (env-gen (lin 0 1 1 1 1) 1 1 0 1 FREE) (repeatedly 5 #(sin-osc (+ 200 (rand-int 999))))))
#+END_SRC

#+BEGIN_SRC clojure
(defmacro play-rand2 []
`(demo 10 (* (env-gen (lin 0 1 1 1 1) 1 1 0 1 FREE) (repeatedly 5 #(sin-osc (+ 200 (rand-int 999)))))))
#+END_SRC
#+RESULTS:
: #'user/play-rand2

#+BEGIN_SRC clojure :results silent
(play-rand2)
#+END_SRC

#+BEGIN_SRC clojure
(defmacro play-rand3 [dur]
`(demo ~dur (repeatedly 5 #(sin-osc (+ 200 (rand-int 999))))))
#+END_SRC
#+RESULTS:
: #'user/play-rand3

#+BEGIN_SRC clojure
(play-rand3 0.1)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 38>

** play-rand4 and event handlers
#+BEGIN_SRC clojure
(defmacro play-rand4 [dur hz]
`(demo ~dur (repeatedly 5 #(sin-osc (+ ~hz (rand-int 999))))))
#+END_SRC

#+RESULTS:
: #'user/play-rand4

#+BEGIN_SRC clojure
(play-rand4 0.2 300)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 53>

#+BEGIN_SRC clojure
(on-event [:midi :note-on]
(fn [e] (play-rand4 0.2 300))
::rand-handler)
#+END_SRC

#+RESULTS:
: :added-async-handler

#+BEGIN_SRC clojure
(remove-event-handler ::rand-handler)
#+END_SRC

#+RESULTS:
: :handler-removed

** note, event-handler uses functions defined in workjournal
[[id:1F1A5066-7662-40A0-98DF-3FF317EBCE41][{2017-01-05 Thu 17:12} "map range" or "lin-lin"]]
#+BEGIN_SRC clojure :results silent
    (on-event [:midi :note-on]
              (fn [{note :note}]
                (do (reset! current-val (maprange [60 91] [0.0 100] note))
                    (println (round2 (deref current-val) 2))))
  ::set-current-val)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::set-current-val)
#+END_SRC

#+BEGIN_SRC clojure :results output
(println (round2 (deref current-val) 2))
#+END_SRC

#+RESULTS:
: 52.76

#+BEGIN_SRC clojure :results silent
  (on-event [:midi :control-change]
            (fn [{cc-channel :note vel :velocity}]
(case vel
127
              (case cc-channel 
                18 (record-val current-val)
                17 (println (deref liked-values))
                :else nil)
0 nil))
            ::record-value-handler)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(remove-event-handler ::record-value-handler)
#+END_SRC

